Саракташ2/src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыПоСерийнымНомерам</registerRecords>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладПолучатель</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйАртикул</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВязальщицаНаСайте</name>
      <type>
        <types>CatalogRef.Мастерицы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатПриемки</name>
      <type>
        <types>CatalogRef.РезультатыПриемки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Недочеты</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Недочет</name>
      <type>
        <types>CatalogRef.НедочетыПриПриемке</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Саракташ2/src/AccumulationRegisters/ЗапасыПоСерийнымНомерам/ЗапасыПоСерийнымНомерам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗапасыПоСерийнымНомерам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/InformationRegisters/ДанныеСерийныхНомеров/ДанныеСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеСерийныхНомеров</name>
  <resources>
    <name>АртикулСтарый</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Вязальщица</name>
    <type>
      <types>CatalogRef.Мастерицы</types>
    </type>
  </resources>
  <resources>
    <name>ВязальщицаНаСайте</name>
    <type>
      <types>CatalogRef.Мастерицы</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Размер</name>
    <type>
      <types>CatalogRef.ДополнительныеЗначенияРеквизитов</types>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </resources>
  <resources>
    <name>Бирка</name>
    <type>
      <types>CatalogRef.Бирки</types>
    </type>
  </resources>
  <resources>
    <name>Приемка</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>EnumRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЗаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/Documents/ПеремещениеТоваров/Forms/ФормаПеремещенияСПроизводства/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		Для Каждого СтрокаТоваров Из НовыеТовары Цикл
			Если Не СтрокаТоваров.Отметка Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ТекущийОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура = СтрокаТоваров.Номенклатура;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.СерийныйНомер = СтрокаТоваров.СерийныйНомер;
			НоваяСтрока.ВязальщицаНаСайте = СтрокаТоваров.МастерицаДляПроверки;
		КонецЦикла;
	Иначе
		СкладБрак = Константы.СкладБрак.Получить(); 
		Для Каждого СтрокаТоваров Из Объект.Товары Цикл
			ТекущийОбъект.Товары[СтрокаТоваров.НомерСтроки - 1].СкладПолучатель = 
			?(СтрокаТоваров.Брак, СкладБрак, Справочники.Склады.ПустаяСсылка());
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДокументОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.СтраницыТоваров.ТекущаяСтраница = Элементы.СтраницаНовыеТовары;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапасыПоСерийнымНомерамОстатки.СерийныйНомер КАК СерийныйНомер,
		|	ЗапасыПоСерийнымНомерамОстатки.КоличествоОстаток КАК Количество,
		|	ЗапасыПоСерийнымНомерамОстатки.СерийныйНомер.Владелец КАК Номенклатура,
		|	ДанныеСерийныхНомеров.Бирка КАК Бирка,
		|	ДанныеСерийныхНомеров.ВязальщицаНаСайте КАК МастерицаДляПроверки
		|ИЗ
		|	РегистрНакопления.ЗапасыПоСерийнымНомерам.Остатки(, Склад = &СкладПроизводства) КАК ЗапасыПоСерийнымНомерамОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСерийныхНомеров КАК ДанныеСерийныхНомеров
		|		ПО ЗапасыПоСерийнымНомерамОстатки.СерийныйНомер = ДанныеСерийныхНомеров.СерийныйНомер";
		Запрос.УстановитьПараметр("СкладПроизводства", Справочники.Склады.Саракташ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = НовыеТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	Иначе
		Элементы.СтраницыТоваров.ТекущаяСтраница = Элементы.СтраницаТовары;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДопПоля()
	
	СкладБрак = Константы.СкладБрак.Получить();
	
	Номера = Объект.Товары.Выгрузить(, "СерийныйНомер").ВыгрузитьКолонку("СерийныйНомер");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеСерийныхНомеров.СерийныйНомер КАК СерийныйНомер,
	|	ДанныеСерийныхНомеров.Бирка КАК Бирка
	|ИЗ
	|	РегистрСведений.ДанныеСерийныхНомеров КАК ДанныеСерийныхНомеров
	|ГДЕ
	|	ДанныеСерийныхНомеров.СерийныйНомер В (&Номера)";
	Запрос.УстановитьПараметр("Номера", Номера);
	Бирки = Новый Соответствие;
	Для Каждого Стр Из Запрос.Выполнить().Выгрузить() Цикл
		Бирки.Вставить(Стр.СерийныйНомер, Стр.Бирка);		
	КонецЦикла;
	
	Для Каждого СтрокаТоваров Из Объект.Товары Цикл
		СтрокаТоваров.Брак = СтрокаТоваров.СкладПолучатель = СкладБрак;
		СтрокаТоваров.Бирка = Бирки[СтрокаТоваров.СерийныйНомер];
	КонецЦикла;   		
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 	
	ПрочитатьДопПоля();  	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПрочитатьДопПоля();
КонецПроцедуры
